ezois_ka/oooezoiskaobmen/src/Documents/ДокументацияПоКонтролируемымСделкам/ДокументацияПоКонтролируемымСделкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументацияПоКонтролируемымСделкам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОКонтролируемойСделке</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФайлаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МетодыЦенообразования</name>
    <attributes>
      <name>ПорядковыеНомераСделок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтороныСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипВзаимозависимости</name>
      <type>
        <types>EnumRef.ТипыВзаимозависимости</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМетодаЦенообразования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваЦенообразования</name>
    <attributes>
      <name>ИдентификаторСтрокиМетода</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМетодаЦенообразования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникИнформацииСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКотировкиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокПримененияКотировкиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокументаЦеныСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКорректировкиДляСопоставимостиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРентабельности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТестируемаяСторона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рентабельность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РыночнаяРентабельность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеМетодаРаспределенияПрибыли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыПриложения</name>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ДокументацияПоКонтролируемымСделкамПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/CommonModules/КонтролируемыеСделкиЦенообразование/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код метода ценообразования сопоставимых рыночных цен.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаСопоставимыхРыночныхЦен() Экспорт
	
	Возврат "01";
	
КонецФункции

// Возвращает код метода ценообразования цены последующей реализации.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаЦеныПоследующейРеализации() Экспорт
	
	Возврат "02";
	
КонецФункции

// Возвращает код затратного метода ценообразования.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаЗатратного() Экспорт
	
	Возврат "03";
	
КонецФункции

// Возвращает код метода ценообразования сопоставимой рентабельности.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаСопоставимойРентабельности() Экспорт
	
	Возврат "04";
	
КонецФункции

// Возвращает код метода ценообразования распределения прибыли.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаРаспределенияПрибыли() Экспорт
	
	Возврат "05";
	
КонецФункции

// Возвращает код метода ценообразования, применяющий комбинацию методов.
// 
// Возвращаемое значение:
//  Строка - код метода ценообразования для контролируемых сделок.
Функция КодМетодаКомбинацияМетодов() Экспорт
	
	Возврат "06";
	
КонецФункции

// Возвращает таблицу значений свойств метода ценообразования.
//
// Параметры:
//  КодМетодаЦенообразования - Строка - код метода цеообразования.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - свойств метода ценообразования:
//  * ИмяПоля - Строка - имя поля.
//  * ОписаниеПоля - Строка - описание поля.
//  * Обязательный - Строка - Истина, если обязательное поле для заполнения.
//  Далее могут быть поля добавлены в зависимости от значения кода метода ценообразования.
//
Функция ПоляСвойствМетодаЦенообразования(КодМетодаЦенообразования) Экспорт
	
	ПоляСвойств = Новый ТаблицаЗначений;
	ПоляСвойств.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	ПоляСвойств.Колонки.Добавить("ОписаниеПоля", Новый ОписаниеТипов("Строка"));
	ПоляСвойств.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	
	Если КодМетодаЦенообразования = КодМетодаСопоставимыхРыночныхЦен() Тогда
		
		ДобавитьПолеСвойств(ПоляСвойств, "ИсточникИнформацииСопоставимыхЦен", НСтр("ru = 'Источник информации'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "НаименованиеКотировкиСопоставимыхЦен", НСтр("ru = 'Наименование котировки'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "ПорядокПримененияКотировкиСопоставимыхЦен", НСтр("ru = 'Порядок применения котировки'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "НаименованиеДокументаЦеныСопоставимыхЦен", НСтр("ru = 'Наименование документа, которым фиксируется цена'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "НаименованиеКорректировкиДляСопоставимостиСопоставимыхЦен", НСтр("ru = 'Наименование корректировки для сопоставимости'"), Истина);
	ИначеЕсли КодМетодаЦенообразования = КодМетодаЦеныПоследующейРеализации()
		Или КодМетодаЦенообразования = КодМетодаЗатратного()
		Или КодМетодаЦенообразования = КодМетодаСопоставимойРентабельности()Тогда
		
		ДобавитьПолеСвойств(ПоляСвойств, "ПоказательРентабельности", НСтр("ru = 'Показатель рентабельности'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "ТестируемаяСторона", НСтр("ru = 'Тестируемая сторона'"), Истина);
		ДобавитьПолеСвойств(ПоляСвойств, "Рентабельность", НСтр("ru = 'Рентабельность'"), Ложь);
		ДобавитьПолеСвойств(ПоляСвойств, "РыночнаяРентабельность", НСтр("ru = 'Рыночная рентабельность'"), Ложь);
	ИначеЕсли КодМетодаЦенообразования = КодМетодаРаспределенияПрибыли() Тогда
		ДобавитьПолеСвойств(ПоляСвойств, "ОписаниеМетодаРаспределенияПрибыли", НСтр("ru = 'Описание метода'"), Истина);
	КонецЕсли;
	
	Возврат ПоляСвойств;
	
КонецФункции

Функция ОписаниеСвойствМетодаЦенообразования(КодМетодаЦенообразования, СвойстваМетода) Экспорт
	
	ОписаниеСвойств = Новый Структура;
	ОписаниеСвойств.Вставить("ЗначенияСвойствСтрокой", "");
	ОписаниеСвойств.Вставить("ЕстьОшибкиЗаполнения", Ложь);
	ОписаниеСвойств.Вставить("ТекстОшибкиЗаполнения", "");
	
	КодыМетодовЦенообразования = Документы.ДокументацияПоКонтролируемымСделкам.КодыМетодовЦенообразования();
	Если КодыМетодовЦенообразования.НайтиПоЗначению(КодМетодаЦенообразования) = Неопределено Тогда
		
		ОписаниеСвойств.ТекстОшибкиЗаполнения = СтрШаблон(
			НСтр("ru = 'Код метода ценообразования %1 нельзя использовать в документации'"),
			КодМетодаЦенообразования);
		ОписаниеСвойств.ЕстьОшибкиЗаполнения = Истина;
		Возврат ОписаниеСвойств;
		
	КонецЕсли;
	
	Если СвойстваМетода.Количество() = 0 Тогда
		
		Если КодМетодаЦенообразования = КодМетодаКомбинацияМетодов() Тогда
			ОписаниеСвойств.ТекстОшибкиЗаполнения = НСтр("ru = 'Не заданы методы ценообразования для комбинации методов'");
		Иначе
			ОписаниеСвойств.ТекстОшибкиЗаполнения = НСтр("ru = 'Не заполнены поля свойств метода ценообразования'");
		КонецЕсли;
		
		ОписаниеСвойств.ЕстьОшибкиЗаполнения = Истина;
		Возврат ОписаниеСвойств;
		
	КонецЕсли;
	
	ЧастиОписания = Новый Массив;
	НезаполненныеПоля = Новый Массив;
	
	Для Каждого СтрокаСвойств Из СвойстваМетода Цикл
		ОписаниеКода = "";
		Если КодМетодаЦенообразования = КодМетодаКомбинацияМетодов() Тогда
			ОписаниеКода = СтрокаСвойств.КодМетодаЦенообразования + ":" + " ";
		КонецЕсли;
		
		ПоляМетода = ПоляСвойствМетодаЦенообразования(СтрокаСвойств.КодМетодаЦенообразования);
		
		ЧастиОписания.Добавить(ОписаниеКода + ОписаниеМетодаСтрокиСвойствЦенообразования(СтрокаСвойств, ПоляМетода));
		
		ДополнитьНезаполненныеПоля(НезаполненныеПоля, СтрокаСвойств, ПоляМетода);
		
	КонецЦикла;
	
	ОписаниеСвойств.ЗначенияСвойствСтрокой = СтрСоединить(ЧастиОписания, Символы.ПС);
	Если НезаполненныеПоля.Количество() > 0 Тогда
		ОписаниеСвойств.ТекстОшибкиЗаполнения = СтрШаблон(
			НСтр("ru = 'Нужно заполнить: %1'"),
			СтрСоединить(НезаполненныеПоля, ", "));
		ОписаниеСвойств.ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ОписаниеМетодаСтрокиСвойствЦенообразования(Строка, ПоляМетода) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПредставленияСвойств = Новый Массив;
	Для Каждого СтрокаПоля Из ПоляМетода Цикл
		ИмяПоля = СтрокаПоля.ИмяПоля;
		ЗначениеПоля = Строка[ИмяПоля];
		
		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПоля = "ТестируемаяСторона" Тогда
			
			СписокВыбораТестируемойСтороны = Документы.ДокументацияПоКонтролируемымСделкам.СписокВыбораТестируемойСтороны();
			ЭлементСписка = СписокВыбораТестируемойСтороны.НайтиПоЗначению(ЗначениеПоля);
			Если ЭлементСписка <> Неопределено Тогда
				ПредставленияСвойств.Добавить(ЭлементСписка.Представление);
			КонецЕсли;
			
		ИначеЕсли ИмяПоля = "Рентабельность"
			Или ИмяПоля = "РыночнаяРентабельность" Тогда
			
			ПредставленияСвойств.Добавить(Формат(ЗначениеПоля, "ЧЦ=6; ЧДЦ=3"));
			
		Иначе
			
			ПредставленияСвойств.Добавить(ЗначениеПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ПредставленияСвойств, ", ");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеСвойств(ПоляСвойств, ИмяПоля, ОписаниеПоля, Обязательный)
	
	НоваяСтрока = ПоляСвойств.Добавить();
	НоваяСтрока.ИмяПоля = ИмяПоля;
	НоваяСтрока.ОписаниеПоля = ОписаниеПоля;
	НоваяСтрока.Обязательный = Обязательный;
	
КонецПроцедуры

Процедура ДополнитьНезаполненныеПоля(НезаполненныеПоля, СтрокаСвойств, ПоляМетода)
	
	Для Каждого СтрокаПоля Из ПоляМетода Цикл
		Если Не СтрокаПоля.Обязательный Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = СтрокаПоля.ИмяПоля;
		ЗначениеПоля = СтрокаСвойств[ИмяПоля];
		
		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			НезаполненныеПоля.Добавить(СтрокаПоля.ОписаниеПоля);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
